Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: གང་ནས་ཀྱང་མཚོན་ཆ་མ་རྙེད་ནས། དེས་འོད་མའི་ཡལ་ག་ལོ་བརྒྱ་ལོན་པ་སྲ་བ་ཞིག་བླངས་ཏེ། བདག་གི་མགུལ་པ་བཅད་ནས་སྟག་མོའི་མདུན་དུ་འགྱེལ་ཏོ། །
en: He could not find a weapon anywhere, so he took the branch of a bamboo that was a hundred years old and hard, cut his throat with it, and fell before the tigress.

source: བྱང་ཆུབ་སེམས་དཔའ་འགྱེལ་མ་ཐག་ཏུ་ཆུའི་དབུས་སུ་སོན་པའི་གྲུ་རླུང་གིས་བསྐྱོད་པ་བཞིན་དུ་ས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: “ ‘As soon as the bodhisattva fell, the earth shook six times like a ship in the middle of water being shaken by the wind.

source: ཉི་མ་ཡང་སྒྲ་གཅན་གྱིས་ཟིན་པ་བཞིན་དུ་འོད་ཟེར་རྣམས་ཀྱིས་མཛེས་པ་མེད་དོ། །
en: The sun also was eclipsed, and the beauty of its light rays vanished.

source: ལྷའི་སྤོས་དང་། ཕྱེ་མ་དང་འདྲེས་པའི་མེ་ཏོག་གི་ཆར་ཡང་བབ་བོ། །
en: There also fell a rain of flowers mixed with divine incense and powders.

source: དེ་ནས་ལྷ་ཞིག་གིས་ངོ་མཚར་དུ་གྱུར་པའི་ཡིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསྟོད་པ། བློ་གྲོས་བཟང་པོ་ཁྱོད་འདིར་ཇི་ལྟར་ཐུགས་རྗེས་སེམས་ཅན་རྣམས་ཁྱབ་སྟེ། །
en: “ ‘Then a deva with a marveling mind praised the bodhisattva: “ ‘ “Excellent wise one, you have in this way pervaded all beings with your compassion.

source: མི་ཡི་དཔའ་བོ་རབ་ཏུ་དགྱེས་པས་ཇི་ལྟར་སྐུ་འདི་ཡོངས་སུ་བཏང་བས་ན། །
en: You have pleased the lords of humans by giving away your body in this way.

source: སྐྱེ་བ་དང་ནི་འཆི་བའི་དོན་དང་བྲལ་བ་ཞི་བའི་གནས་ཀྱི་མཆོག །ཞི་བ་གཙང་མ་ཁྱོད་ཀྱིས་འདིར་ནི་ཚེགས་མེད་རིང་པོར་མི་ཐོགས་བརྙེས། །
en: You will soon find here, without difficulty and without impediment, a pure peace, The supreme state of peace that is free of the meaning of birth and death.”

source: དེ་ནས་སྟག་མོ་དེས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཁྲག་གིས་སྦགས་པ་ལ་བལྟས་ནས། ཡུད་ཙམ་གྱིས་ཤ་དང་ཁྲག་མེད་པར་རུས་པ་ཙམ་ཞིག་ལུས་པར་བྱས་སོ། །
en: “ ‘The tigress saw the bodhisattva’s body soaked in blood, and soon there was nothing left of the body but bones without flesh or blood.

source: དེ་ནས་སྒྲ་ཆེན་པོས་ས་གཡོས་པ་དེ་ལ་བསམས་ནས་ལྷ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇི་ལྟར་ཕྱོགས་བཅུར་རྒྱ་མཚོ་མཐར་ཐུག་རྒྱ་མཚོར་བཅས་པ་ཡི། །ས་འདི་རབ་ཏུ་གཡོས་ཤིང་ཉི་མ་འང་འོད་ནི་མེད་གྱུར་ལ། །མེ་ཏོག་ཆར་པ་འབབ་ཅིང་ཁོ་བོའི་ཡིད་ཀྱང་འཁྲུགས་པས་ན། །
en: “ ‘Then Mahāpraṇāda, thinking about the earthquake, said to Mahādeva: “ ‘ “This earth, as far as the oceans and including the oceans, shook; The sun was without light, and there was a rain of flowers.

source: ད་གཟོད་བདག་གི་ནུ་བོས་རང་གི་ལུས་ནི་བཏང་ཡང་དག །
en: Also, my mind became disturbed, so it seems as if Our younger brother has given away his body.”

source: ལྷ་ཆེན་པོས་སྨྲས་པ། དེ་ནི་ཇི་ལྟར་སྙིང་རྗེའི་ཚིག་སྨྲ་ལ། །བཀྲེས་དང་ལྡན་ཞིང་སྡུག་བསྔལ་བརྒྱས་གཙེས་པ། །ཤིན་ཏུ་ཉམ་ཆུང་རང་གི་བུ་ལ་ཡང་། །ཟ་བར་ཆས་ལ་བལྟ་བས་བདག་ཀྱང་དོགས། །
en: “ ‘Mahādeva said: “ ‘ “I also became worried when he spoke Those words of compassion while gazing upon The starving one tormented by a hundred sufferings, Extremely weak and ready to eat her own cubs.”

source: དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་དེ་གཉིས་རབ་ཏུ་མྱ་ངན་གྱིས་ནོན་ནས་མཆི་མས་མིག་གང་སྟེ། ལམ་དེ་ཉིད་ནས་སླར་ལོག་ནས་སྟག་མོའི་དྲུང་དུ་ཕྱིན་པ་དང་།
en: “ ‘Then those two young princes, oppressed by sadness, their eyes filled with tears, returned along their path and reached the tigress.

source: གོས་ཐམས་ཅད་ནི་འོད་མའི་ཡལ་ག་དག་ལ་གཟར། རུས་པ་རྣམས་ནི་བྱེ་ཞིང་བྲལ། ཁྲག་ནི་རྫབ་ཏུ་གྱུར། སྐྲ་ནི་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འཐོར་བར་མཐོང་ངོ་། །
en: They saw all their brother’s clothes were hung upon a bamboo branch, his bones were torn apart and separated, his blood had muddied the ground, and his hair was scattered here and there.

source: མཐོང་ནས་ཀྱང་བརྒྱལ་ཏེ་རུས་པའི་སྟེང་དུ་འགྱེལ་ནས་རིང་ཞིག་ལོན་པ་དང་། འདུ་ཤེས་རྙེད་དེ་ལངས་ནས་ལག་པ་བསྒྲེང་སྟེ་ཉམ་ཐག་པའི་སྒྲ་ཕྱུང་ངོ་། །
en: “ ‘When they saw that, they fainted, falling on his bones, where they lay for a while until they revived, stood up, stretched out their arms, and emitted cries of despair.

source: ཀྱེ་མའོ་ནུ་བོ་སྡུག་པ་དང་ནི་རྒྱལ་པོ་དང་། །
en: “ ‘ “Alas! Beloved young brother!

source: དེ་བཞིན་དུ་ནི་བུ་ལ་རབ་ཏུ་གདུང་བའི་མ། །པདྨ་འདྲ་མིག་དེ་རིང་ཁྱེད་ཀྱིས་གར་བཞག་ཅེས། །མ་ནི་བདག་ཅག་ལ་ཡང་ཐ་ཆུངས་འདྲི་བར་འགྱུར། །
en: The king And also the mother who loves her son Will ask us about our little brother: ‘Where have you left the one with lotus eyes?’

source: ཀྱེ་མ་བདག་ཅག་གཉིས་ནི་ས་ཕྱོགས་འདི་ཉིད་དུ། །ཤི་ན་ལེགས་ཀྱིས་གསོན་པ་དེ་ལྟ་མ་ཡིན་ནོ། །
en: “ ‘ “Alas, it would be better for us two to die In this place, for it will not be good if we live!

source: སྙིང་སྟོབས་ཆེན་པོ་མེད་པར་གྱུར་པས་བདག་ཅག་ལ། །ཕ་མ་དག་གིས་ཇི་ལྟར་ལྟོ་བ་སྟེར་བར་འགྱུར། །
en: How will our parents be able to look upon us When Mahāsattva no longer exists?”

source: དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་དེ་གཉིས་ཀྱིས་སྙིང་རྗེ་རྗེའི་སྐད་དུ་རྣམ་པ་མང་པོར་ངུས་ནས་དོང་ངོ་། །
en: “ ‘Then the two young princes, weeping and crying out pitifully in many ways, returned.

source: དེ་ནས་རྒྱལ་བུ་གཞོན་ནུའི་རིམ་གྲོ་པ་རྣམས་ཀྱང་གཞོན་ནུ་ཚོལ་ཞིང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་རྒྱུག་པ་དང་། གཅིག་གིས་གཅིག་མཐོང་ནས། གཞོན་ནུ་ག་རེ།
en: “ ‘The attendants of the young princes had gone in search of them, running around in all directions, and when they saw one another they asked, “Where is the boy?

source: གཞོན་ནུ་ག་རེ་ཞེས་འདྲིའོ། །
en: Where is the boy?”

source: དེའི་ཚེ་བཙུན་མོ་མལ་ན་ཉལ་བའི་རྨི་ལམ་ན་སྡུག་པ་དང་བྲལ་བར་རྨིས་པ་འདི་ལྟ་སྟེ། ནུ་མ་གཉིས་བཅད་པ་དང་། སོ་ཕྱུང་བ་དང་། ཐི་བའི་ཕྲུ་གུ་སྡུག་པ་གསུམ་ཞིག་རྙེད་པ་ལས་གཅིག་ཁྲས་ཁྱེར་བ་རྨིས་སོ། །
en: “ ‘At that time, the queen was sleeping in her bed, and in a dream she became separated from a loved one in this way: her breasts were both cut off, her teeth fell out, and she saw a hawk carry off one of three frightened dove chicks.

source: དེ་ནས་བཙུན་མོ་ས་གཡོས་པས་སྙིང་དངངས་ཏེ། མོད་ལ་སད་ནས་སེམས་པ་ལ་ཞུགས་ཏེ། འབྱུང་པོའི་རྟེན་མ་རྒྱ་མཚོའི་གོས་ཅན་འདི་ནི་ཀུན་ཏུ་རབ་གཡོ་ཅི་ཞིག་གུ། །
en: Then the queen, alarmed by the earth shaking, woke up at that moment and became deep in thought: “ ‘ “This support of beings, which is clothed by the oceans, has been completely shaken.

source: ཉི་མའི་འོད་ཟེར་མེད་པར་གྱུར་པས་ང་ཡི་སྙིང་ལ་མྱ་ངན་འགྱུར་བ་སྟོན། །
en: The light rays of the sun vanished which indicates that there will be grief in my heart.

source: ང་ཡི་ལུས་ནི་ཞུམ་ཞིང་མིག་ཀྱང་གཡོ་ལ་རང་གི་ནུ་མ་བཅད་རྨིས་པ། །
en: My limbs weakened, my eyes rolled, and I dreamed my breasts were cut off.

source: ང་ཡི་བུ་རྣམས་ནགས་ཁྲོད་འདིར་ནི་རྩེར་དོང་བ་ལ་དགེ་བར་གྱུར་རམ་ཀྱེ། །དེ་ནས་དེ་སྙམ་དུ་བསམས་པ་དང་།
en: My sons who have gone to play in the forest—is all well with them or not?”

source: བྲན་མོ་ཡང་སྙིང་མྱོས་ཏེ་འོངས་ནས་བཙུན་མོ་ལ་སྨྲས་པ། ཇོ་མོ་གཞོན་ནུའི་རིམ་གྲོ་པ་དག་གཞོན་ནུ་ཚོལ་ཞིང་མཆིས་ན། ཇོ་བོ་སྟོར་ཞེས་གདའོ། །
en: “ ‘As she was thinking in this way, a servant, deeply distressed, came and said to the queen, “Your Majesty, the attendants of the princes say that they are searching for the boys, that the lords are lost!”

source: དེ་སྐད་ཐོས་མ་ཐག་ཏུ་བཙུན་མོ་སྙིང་འདར་ཞིང་། མིག་དང་གདོང་མཆི་མས་གང་སྟེ།
en: “ ‘The moment the queen heard that her heartbeat quivered, and her eyes and face streamed with tears.

source: རྒྱལ་པོའི་གན་དུ་སོང་ནས་སྨྲས་པ། ལྷ་བདག་གི་བུ་སྡུག་པ་སྟོར་ཅེས་ཐོས་སོ། །
en: She went to the king and said, “Your Majesty, I have heard that our beloved sons are lost!”

source: རྒྱལ་པོ་ཡང་སྙིང་འདར་ཞིང་ཤིན་ཏུ་མྱོས་ཏེ།
en: “ ‘The king’s heart quivered also, and he was very distressed and cried, “Alas!

source: ཀྱི་ཧུད་བདག་གི་བུ་སྡུག་པ་དང་བྲལ་བ་ལྟ་ཞེས་སྨྲས་སོ། །
en: I have lost my beloved sons!”

source: དེ་ནས་རྒྱལ་པོས། བཙུན་མོ་དབུགས་དབྱུང་བའི་ཕྱིར། ང་གཞོན་ནུ་བཙལ་བ་ལ་ནན་ཏན་དུ་བྱེད་ཀྱིས། བཟང་མོ་མྱ་ངན་མ་བྱེད་ཅིག །
en: “ ‘Then the king, in order to reassure the queen, said, “I will diligently search for the boys, so do not distress yourself, Your Majesty.”

source: དེར་གཞོན་ནུ་ཚོལ་བ་ལ་ཞུགས་པ་དང་སྐྱེ་བོའི་ཚོགས་དག་རོད་རོད་པོར་གྱུར་ཏོ། །
en: “ ‘He then went in search of the boys, with many people busily engaged in it.

source: དེ་ནས་རིང་པོར་མ་ལོན་པར་རྒྱལ་པོས། རྒྱལ་བུ་གཞོན་ནུ་གཉིས་རྒྱང་རིང་པོ་ནས་འོང་བ་མཐོང་ངོ་། །
en: Before long, the king saw the two princes coming in the distance.

source: མཐོང་ནས་ཀྱང་སྨྲས་པ། གཞོན་ནུ་དེ་དག་ནི་འོང་ན་ཐམས་ཅད་ནི་མ་ཡིན་ཏེ།
en: When he saw them, he cried out, “Those are the boys coming, but not all of them are there! Oh!

source: ཀྱི་ཧུད་བུ་དང་བྲལ་བ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་བའོ། །
en: It seems we have lost a son!”

source: ཇི་ལྟར་བུ་དང་བྲལ་བར་གྱུར་ན་ཡིད་ནི་མི་བདེ་བ། །མི་རྣམས་བུ་རྙེད་པ་ནི་དེ་ལྟར་དགའ་བ་མ་ཡིན་ནོ། །
en: In suffering, he said: “ ‘ “The happiness that humans have on obtaining a child Does not equal the unhappiness from losing a child.

source: འཇིག་རྟེན་ན་ནི་གང་དག་བུ་མེད་པ་དང་ཤི་བའམ། །མི་རྣམས་གང་དག་བུ་གསོན་དེ་དག་བདེ་བ་ཡིན་ནམ་ཅི། །
en: Are not those humans in this world happy who die while Their sons are alive, or who have not given birth to children?”

source: དེ་ནས་བཙུན་མོ་ཤིན་ཏུ་མྱ་ངན་གྱིས་ནོན་ནས། རྔ་མོ་གནད་དུ་བསྣུན་པ་བཞིན་དུ། ཤིན་ཏུ་མི་བཟད་པའི་སྒྲ་ཕྱུང་ངོ་། །
en: “ ‘Then the queen, oppressed by misery like a heart-broken she-camel, emitted dreadful cries.

source: དེ་ལྟར་བུ་གསུམ་དག་ནི་གཡོག་གི་ཚོགས་བཅས་ཏེ། །མེ་ཏོག་རྣམས་ཀྱིས་གང་བའི་ནགས་ཁྲོད་ཞུགས་པ་ལས། །བདག་གི་བུ་དགེ་ཐ་ཆུངས་འོངས་པར་མ་གྱུར་ན། །
en: “ ‘ “Thus my three boys, with their servants, Entered the flower-filled forest But my lovely youngest child has not returned!

source: བདག་གི་སྙིང་དང་འདྲ་བའི་ཐ་ཆུངས་དེ་ག་རེ། །
en: Where is my youngest son, who is like my own heart?”

source: དེ་ནས་དེ་གཉིས་ལྷགས་པ་དང་། རྒྱལ་པོས་བུ་ལ་དྲིས་པ།
en: “ ‘Then the two princes arrived, and the king questioned them.

source: ཁྱེའུ་ཐ་ཆུངས་ག་རེ་ཞེས་གཞོན་ནུ་གཉིས་ལ་དྲིས་པ་དང་།
en: He asked the two youths, “Where is your youngest brother?”

source: དེ་ནས་མྱ་ངན་གྱིས་ཉམ་ཐག་ཅིང་མིག་མཆི་མས་གང་སྟེ། རྐན་དང་། མཆུ་དང་། ཁ་དང་། སོ་སྐམས་ནས་ཅང་མི་ཟེར་རོ། །
en: “ ‘They were so devastated by misery, their eyes filled with tears, and their palates, lips, mouths, and teeth having become dry, that they could not say anything.

source: བཙུན་མོས་སྨྲས་པ། ཁོ་མོའི་བུ་སྡུག་ཐ་ཆུངས་དེ་ག་རེ།
en: “ ‘The queen asked: “ ‘ “Where is my beloved youngest son?

source: ཁོ་མོའི་སྙིང་འདི་གས་ལ་ཐུག་གྱུར་ཅིང་། །ལུས་ནི་མི་བཟད་རབ་ཏུ་གཟིར་གྱུར་ཏེ། །ཁོ་མོའི་དྲན་པ་ཉམས་གྱུར་མྱུར་དུ་སྨྲོས། །
en: This heart of mine is about to break, My body is struck by unendurable pain, And my mind is fainting, so tell me quickly!”

source: དེ་ནས་གཞོན་ནུ་དེ་གཉིས་ཀྱིས་ཇི་ལྟར་གྱུར་པ་དེ་ཞིབ་ཏུ་སྨྲས་སོ། །དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དང་། བཙུན་མོ་མྱོས་པར་གྱུར་ཏེ།
en: “ ‘The two youths then related in detail what had occurred, and as soon as the king and queen heard it, they swooned.

source: མྱོས་པ་སངས་ནས་སྙིང་རྗེ་རྗེའི་སྐད་དུ་ངུ་ཞིང་ཕྱོགས་དེར་དོང་ངོ་། །
en: When they recovered from their swoon, they cried piteously and went to that place.

source: དེ་ནས་རྒྱལ་པོ་དང་བཙུན་མོས་རུས་པ་དེ་དག །ཤ་དང་། ཁྲག་དང་། རྒྱུས་པ་མེད་ཅིང་། སྐྲ་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འཐོར་བ་མཐོང་ནས་ཤིང་རླུང་གིས་བཏབ་པ་བཞིན་དུ་འགྱེལ་ཏོ། །
en: “ ‘When the king and queen saw those bones with no flesh, blood, or entrails remaining and the hair scattered here and there, they collapsed as if blown over by a wind.

source: དེ་ནས་མདུན་ན་འདོན་པ་དང་། བློན་པོ་དག་གིས་དེ་ལྟར་གྱུར་པ་དེ་མཐོང་ནས། ཆུ་དང་རི་མ་ལ་ཡའི་ཙནྡན་གྱི་ལྡེ་གུས། རྒྱལ་པོ་དང་བཙུན་མོའི་ལུས་སིམ་པར་བྱས་སོ། །
en: “ ‘When the principal attendants and ministers saw that, they soothed the king’s and queen’s bodies with a balm made of water and Malaya Mountain sandalwood.

source: དེ་ནས་རིང་ཞིག་ལོན་པ་དང་། འདུ་ཤེས་རྙེད་ནས། རྒྱལ་པོ་ལངས་ཏེ་སྙིང་རྗེ་རྗེའི་སྐད་དུ་འབོད་པ། ཀྱི་ཧུད་བུ་སྡུག་ཡིད་འོང་མཐོང་དགའ་བ། །འཆི་བདག་དབང་དུ་ཅི་ཕྱིར་མྱུར་དུ་སོང་། །
en: “ ‘After a long time had passed, they recovered consciousness, and the king stood and cried out piteously: “ ‘ “Why has my beautiful, handsome, delightful son Fallen so quickly under the power of the lord of death?

source: འཆི་བདག་ཅི་ཕྱིར་ང་ལ་སྔར་མ་འོངས། །
en: Why have I not gone to the lord of death before him?

source: ང་ལ་སྡུག་བསྔལ་འདི་ལས་གཞན་མི་འབྱུང་། །
en: Compared to this, I have never had any suffering.”

source: བཙུན་མོ་ཡང་མྱོས་པ་ལས་ལངས་ནས། སྐྲ་ཞིག་ཅིང་ལག་པ་གཉིས་ཀྱིས་བྲང་བརྡུངས་ཏེ། ཉ་ཐང་ལ་ཕྱུང་བ་བཞིན་དུ་སའི་སྟེང་ན་འགྲེ་ལྡོག་ཅིང་མ་ཧེའི་བེའུ་སྟོར་བ་དང་།
en: “ ‘The queen also, when she had recovered from her faint, loosened her hair, beat her breast with both hands, writhed on the ground like a fish on dry land, and cried out piteously like a female buffalo or a female camel that has lost her offspring: “ ‘ “Alas!

source: རྔ་མོ་རྔེའུ་སྟོར་བ་བཞིན་དུ་སྙིང་རྗེ་རྗེའི་སྐད་དུ་ངུའོ། །ཀྱི་ཧུད་སྡུག་ཅིང་གཅེས་པའི་བུ་ནི་པདྨ་འདི། །སུ་ཡིས་ས་ཡི་སྟེང་དུ་བཤིག་ནས་རབ་ཏུ་གཏོར། །
en: Who would rend and scatter on the earth My beloved, beautiful son, who was like a lotus?

source: ཡིད་འོང་མིག་ལྡན་ཟླ་འདྲའི་བཞིན་ཅན་བདག་གི་བུ། །བདག་གི་དགྲ་བོ་གང་གིས་དེ་རིང་ས་འདིར་བཅོམ། །
en: What enemy of mine has, on this day, in this place, destroyed My son who had beautiful eyes and a face like the moon?

source: ཀྱི་ཧུད་ས་འདིར་བུ་མཆོག་བསད་མཐོང་བ། །ལུས་འདི་ཅི་ཕྱིར་དེ་རིང་ཞིག་མ་གྱུར། །
en: “ ‘ “Alas! Why has my body not been broken on this day By seeing my perfect son slain on this ground?

source: སྡུག་བསྔལ་འདི་འདྲ་མཐོང་ཡང་མ་གས་པས། །བདག་གི་སྙིང་འདི་ལྕགས་ནི་ཡིན་ཡང་དག །
en: This heart of mine must truly be made of iron To have not split apart on witnessing this suffering.

source: དེ་རིང་རྨི་ལམ་དུ་ནི་བདག་གི་ནུ་མ་འགའ་ཞིག་གིས་ནི་རལ་གྲིས་བཅད། །སོ་ཡང་ཕྱུང་བས་དེ་རིང་བདག་གི་བུ་སྡུག་དེ་ནི་མྱུར་དུ་མ་རུང་གྱུར། །
en: “ ‘ “Because in a dream I had today Someone cut off my breasts with a sword And my teeth fell out, I knew something Dreadful had happened to my son.

source: བདག་གིས་ཐི་བའི་ཕྲུ་གུ་གསུམ་ཞིག་རྙེད་པ་གཅིག་འདིར་ཇི་ལྟར་ཁྲས་ཁྱེར་བཞིན། །
en: “ ‘ “I had found three chicks of a dove, And one of them was taken away by a hawk.

source: བདག་ནི་བུ་གསུམ་དག་གིས་བསྐོར་བ་ལས་ཀྱང་གཅིག་ནི་དེ་རིང་འཆི་བདག་ཁྱེར། །ཀྱི་ཧུད་སྡིག་པ་ཅན་གྱི་རྨི་ལམ་དེ་ཡི་འབྲས་བུ་གྲུབ་པ་འདི་ཡིན་ནོ། །
en: In that way, from the three boys who were around me, The lord of death has taken one away today.”

source: དེ་ནས་རྒྱལ་པོ་དང་བཙུན་མོ་སྙིང་རྗེ་རྗེའི་སྐད་དུ་རྣམ་པ་མང་པོས་སྨྲེ་ཞིང་རྒྱན་ཐམས་ཅད་བཀྲོལ་ནས། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་ཏུ་བུའི་རུས་པ་ལ་མཆོད་པ་བྱས་ནས། གཞོན་ནུའི་རུས་པ་རྣམས་ས་ཕྱོགས་འདིར་བཞག་གོ། །
en: “ ‘Then the king and queen, crying out pitifully many times, cast off their jewelry and together with a great crowd of beings made offerings to the boy’s bones, and then they placed the bones in this spot.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་བུ་གཞོན་ནུ་སྙིང་སྟོབས་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “ ‘Ānanda, if you think that at that time, in that time, the prince called Mahāsattva was anyone else, do not have that view.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་བུ་གཞོན་ནུ་སྙིང་སྟོབས་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: At that time, I was the prince called Mahāsattva.

source: ཀུན་དགའ་བོ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལས་ཡོངས་སུ་མ་གྲོལ་བ་དེའི་ཚེ་ཡང་སེམས་ཅན་དམྱལ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་ལས། ངས་འགྲོ་བ་མཐའ་དག་ལ་ཕན་བཏགས་ནས་སྐྱོན་ཐམས་ཅད་དང་བྲལ་ཏེ། ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་པ་ད་ལྟར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “ ‘Ānanda, even at that time, when I was not completely freed from desire, anger, and ignorance, I helped every being, such as those in the hells, be freed from suffering, let alone now when I am a samyaksaṃbuddha who is free of all faults.

source: དེ་ལྟར་སེམས་ཅན་རེ་རེའི་ཕྱིར་ཡང་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་བསྐལ་པར་གནས་པར་སྤྲོ་ཞིང་། སྐྱེ་བའི་འཁོར་བ་ལས་རྣམ་པར་དགྲོལ་ལོ། །
en: “ ‘In that way, for the sake of each being I would gladly remain in hell for eons and liberate that being from saṃsāra.

source: སེམས་ཅན་གྱི་སྙིང་པོས་ཤིན་ཏུ་བྱ་དཀའ་བ་རྣམ་པ་སྣ་ཚོགས་པ་དུ་མས་འགྲོ་བ་མཐའ་དག་ལ་ཕན་བཏགས་སོ། །
en: Those who are dedicated to beings accomplish numerous different kinds of difficult actions so as to benefit all beings.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །བྱང་ཆུབ་མཆོག་འདི་ཡོངས་སུ་ཚོལ་བ་ན། །བསྐལ་པ་མང་པོར་ངས་ནི་ལུས་བཏང་སྟེ། །
en: “The Bhagavat then spoke these verses: “ ‘For many eons, I gave away my body When seeking the highest enlightenment.

source: ཇི་ལྟར་རྒྱལ་པོ་དང་ནི་རྒྱལ་བུར་གྱུར། །དེ་ལྟར་ངས་ནི་ལུས་རྣམས་ཡོངས་སུ་བཏང་། །
en: Whether I was a king or a prince, I gave away my body in that way.

source: སྔོན་གྱི་ཚེ་རབས་རྣམས་ནི་རྗེས་དྲན་ཏེ། །ཤིང་རྟ་ཆེན་པོ་ཞེས་བྱའི་རྒྱལ་པོ་བྱུང་། །དེ་ལ་བུ་ནི་གཏོང་བ་ཆེ་ལྡན་པ། །སྙིང་སྟོབས་ཆེ་ཞེས་བྱ་བ་དམ་པ་ཡོད། །
en: “ ‘I remember my previous lives: There was a king named Mahāratha Who had a son that made the great gift, A sublime one called Mahāsattva.

source: དེ་ལ་ཕུ་བོ་དག་ནི་གཉིས་ཡོད་དེ། །མིང་ནི་སྒྲ་ཆེན་པོ་དང་ལྷ་ཆེན་པོ། །
en: “ ‘He had two elder brothers Named Mahāpraṇāda and Mahādeva.

source: སྤུན་ཚོགས་དེ་དག་ནགས་ཚལ་ཁྲོད་དུ་དོང་། །དེ་དག་སྟག་མོ་བཀྲེས་པས་གཟིར་བ་མཐོང་། །
en: The group of siblings went into a thick forest Where they saw a tigress tormented by hunger.

source: དེ་ལ་སེམས་ཅན་མཆོག་དེ་སྙིང་རྗེ་སྐྱེས། །སྟག་མོ་འདི་ནི་བཀྲེས་སྐོམ་གཟིར་བས་ན། །བདག་བུ་དེ་དག་ཟ་བར་འགྱུར་འོང་གིས། །
en: “ ‘Compassion for her arose in that excellent being: “This tigress is so tormented by hunger and thirst She will eventually eat her own children.

source: དེ་ལྟར་བདག་ལུས་ད་ནི་གཏང་བར་བྱ། །
en: Therefore, I will give her my body.”

source: ཤིང་རྟ་ཆེ་ཡི་བུ་ནི་སྙིང་སྟོབས་ཆེ། །སྟག་མོ་བཀྲེས་མཐོང་སྟག་ཕྲུག་རྣམས། །ཐར་བར་བྱ་ཕྱིར་སྙིང་རྗེ་ཡིས། །རི་ངོས་གཟར་ནས་མཆོངས་པ་དང་། །
en: “ ‘Mahāsattva, Mahāratha’s son, Seeing the hungry tigress, with compassion So as to save the tiger cubs Leapt from a mountain cliff.

source: ས་ནི་རི་དང་བཅས་སུ་གཡོས། །བྱ་ཚོགས་རྣམ་མང་རྣམ་པར་མཐོང་། །རི་དགས་ཚོགས་སྐྲག་འཇིག་རྟེན་འདི། །མུན་པས་ཐིབས་པོར་གནས་པར་གྱུར། །
en: “ ‘The earth and the mountains shook, The multitudes of birds scattered, The herds of deer were frightened, And this world was enveloped in darkness.

source: དེ་ཡི་ཕུ་བོ་སྒྲ་ཆེན་དང་། །དེ་བཞིན་ལྷ་ཆེན་དེ་གཉིས་ཀྱིས། །ནགས་ཚོགས་ཆེན་པོ་དེར་བལྟས་ན། །སྙིང་སྟོབས་ཆེན་པོ་མ་རྙེད་ནས། །
en: “ ‘His older brother Mahāpraṇāda, And likewise Mahādeva, both Looked in that great forest But could not find Mahāsattva.

source: ཤིན་ཏུ་མྱ་ངན་ཟུག་རྔུས་སྙིང་། །དྲན་མེད་ནགས་ཀྱི་ནང་དུ་རྒྱུ། །ནུ་བོ་དེ་ནི་ཡོངས་ཚོལ་ཞིང་། །
en: “ ‘Their hearts pained by intense misery, They roamed within the forest mindlessly, Searching for their younger brother.

source: གདོང་ལ་མཆི་ཟག་ནགས་ཁྲོད་རྒྱུ། །
en: Faces streaming with tears, they wandered the forest.

source: སྒྲ་ཆེན་དེ་བཞིན་ལྷ་ཆེན་པོ། །རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་གཉིས། །སྟག་མོ་ཉམ་ཆུང་གར་ཉལ་བ། །དེར་ནི་ཉེ་བར་སོང་བ་དང་། །
en: “ ‘Those two young princes, Mahāpraṇāda and Mahādeva, Came near the place where The weakened tigress was lying.

source: སྟག་མོ་དང་ནི་སྟག་ཕྲུག་གི། །སྟག་གི་མཆུ་ལ་ཁྲག་ཆགས་མཐོང་། །སྐྲ་དང་རུས་པ་ཅུང་ཟད་ཅིག །ས་ལ་རྣམ་པར་འཐོར་བ་མཐོང་། །
en: “ ‘They saw blood on the mouths Of the tigress and the tiger cubs, And some bones and hair were Scattered there upon the ground.

source: དེ་ཡི་ཁྲག་གི་ཐིགས་པ་ནི། །ཉུང་ཞིག་ས་ལ་ཡོད་པར་གྱུར། །
en: “ ‘There were a few drops of blood That had fallen onto the ground.

source: རྒྱལ་པོའི་བུ་ནི་དེ་གཉིས་ཀྱིས། །ཁྲག་ཆགས་པ་ཡི་ས་དེ་མཐོང་། །རབ་ཏུ་བརྒྱལ་ཏེ་ས་དེ་ལ། །འགྱེལ་ནས་ཡིད་ནི་ཉམས་པར་གྱུར། །
en: Those two princes saw that The earth was bloodstained.

source: ལུས་རྣམས་ལ་ནི་རྔུལ་གྱིས་གོས། །དྲན་དབང་ཉམས་ཤིང་སེམས་ཀྱང་མྱོས། །
en: “ ‘They completely fainted away And lay on the ground unconscious, Their bodies covered with dirt, Without awareness, their minds in a swoon.

source: དེ་དག་གི་ནི་འཁོར་རྣམས་ཀྱང་། །སྙིང་རྗེར་ངུ་ཞིང་མྱ་ངན་ནོན། །
en: “ ‘All of their entourage Wept piteously, overcome with misery.

source: དེ་དག་ཆུས་ནི་རབ་འཐོར་ཞིང་། །ལག་པ་བསྒྲེང་སྟེ་ངུ་ཞིང་གནས། །
en: They sprinkled water upon them And with arms outstretched, wept.

source: དེ་ནི་འགྱེལ་མ་ཐག་ཏུ་ཡང་། །བཙུན་མོ་གཅེས་མཆོག་སྐྱེད་པའི་མ། །བུད་མེད་དག་ནི་ལྔ་བརྒྱ་དང་། །ཕོ་བྲང་ནང་ན་བདེར་འདུག་པ། །
en: “ ‘The moment that they had fainted, Their mother, the beloved principal queen, Was happily dwelling in the palace With five hundred other women.

source: ནུ་སོར་གཉི་གའི་རྩེ་མོ་ནས། །འོ་མ་ཁྲག་ཏུ་འབྱུང་ཞིང་འཛག །
en: “ ‘From the nipples of both breasts, Her milk came forth as dripping blood.

source: དེ་ཡི་ལུས་དང་ཡན་ལག་ཀུན། །ཁབ་ཀྱིས་བཙགས་པ་བཞིན་དུ་ཚ། །
en: Her entire body and all her limbs Were in pain as if pierced by needles.

source: སྙིང་ནི་རབ་ཏུ་མྱ་ངན་གང་། །བུ་བྲལ་མྱ་ངན་དྲག་མདས་ཕོག །
en: “ ‘Her heart became filled with misery, Hit by the arrow of the grief of losing a child.

source: རྒྱལ་པོའི་གན་དུ་ཉེར་སོང་སྟེ། །མྱ་ངན་རབ་གདུངས་ཡིད་མི་དགའ། །
en: She came before the king, Deeply tormented by misery and in distress.

source: སྙིང་རྗེའི་སྒྲ་ཡིས་རབ་ངུ་ཞིང་། །རྒྱལ་པོ་ཤིང་རྟ་ཆེ་ལ་སྨྲས། །མི་དབང་རྒྱལ་པོ་བདག་ལ་གསོན། །
en: “ ‘With piteous cries she wept And said to King Mahāratha, “King, lord of men, listen to me.

source: བདག་ལུས་མྱ་ངན་མེ་ཡིས་ཚིག །
en: My body is burned by the fire of misery.

source: བདག་གི་ནུ་སོར་རྩེ་གཉིས་ནས། །འོ་མ་ཁྲག་ཏུ་རབ་ཏུ་འབྱུང་། །
en: “ ‘ “From the nipples of both my breasts The milk has emerged as blood.

source: བདག་ལུས་ཁབ་ཀྱིས་བཙགས་བཞིན་ཚ། །བདག་གི་སྙིང་ཡང་གས་ལ་ཐུག །
en: My body is in pain as if pierced by needles, And my heart feels about to break.

source: ཇི་ལྟར་སྡུག་པའི་བུ་རྣམས་ནི། །ཕྱིན་ཅད་མི་མཐོང་འདི་འདྲའི་ལྟས། །
en: “ ‘ “This seems to be a sign that I will Never again see my beloved sons.

source: བདག་གི་བུ་རྣམས་དེ་ལྟར་འཚལ། །ཐུགས་རྗེ་མཛོད་དེ་བདག་སྲོག་སྩོལ། །
en: Therefore, regard me with compassion— Find my sons and give me my life!

source: དེ་རིང་བདག་གི་རྨི་ལམ་ན། །ཐི་བའི་ཕྲུ་གུ་གསུམ་རྙེད་ན། །བདག་གི་ཐི་བའི་ཕྲུ་གུ་ནི། །
en: “ ‘ “In a dream that I had today, I found three dove chicks.

source: སྡུག་ཅིང་ཡིད་འོང་གང་ལགས་པ། །
en: One of the dove chicks was, To me, the loveliest and prettiest.

source: དེར་ནི་ཁྲ་མཆིས་བདག་གི་ནི། །ཐི་བའི་ཕྲུ་གུ་དེ་ཁྲས་འཚལ། །
en: “ ‘ “A hawk came, and that hawk Took my dove chick away.

source: བདག་གི་རྨི་ལམ་འདི་འདྲ་ཡི། །མྱ་ངན་སྙིང་འདིར་རབ་ཏུ་ཞུགས། །
en: A grief like that in the dream Has entered here into my heart.

source: སེམས་ནི་མྱ་ངན་རབ་གདུངས་པས། །བདག་ནི་རིང་པོར་མི་ཐོགས་འགུམ། །
en: “ ‘ “My mind is so tormented by sadness It will not be long before I die.

source: བདག་གིས་བུ་རྣམས་དེ་ལྟར་འཚལ། །ཐུགས་རྗེ་ལྡན་པ་བདག་སྲོག་སྩོལ། །
en: Therefore, you who are compassionate, Find my sons and give me my life!”

source: དེ་སྐད་སྨྲས་ནས་བཙུན་མོ་མཆོག །བརྒྱལ་ནས་ས་དེར་འགྱེལ་བར་གྱུར། །དྲན་པའི་དབང་པོ་རྣམ་པར་ཉམས། །སེམས་ཀྱང་སྟོར་ཞིང་དྲན་པ་མེད། །
en: “ ‘After she had spoken, the principal queen Fainted and lay there on the floor, The faculty of awareness lost, Her mind scattered and unconscious.

source: བཙུན་མོའི་འཁོར་ཚོགས་ཐམས་ཅད་ཀྱང་། །སྙིང་རྗེའི་སྐད་ཀྱིས་རབ་ཏུ་ངུ་། །བཙུན་མོ་དམ་པ་བརྒྱལ་གྱུར་ཏེ། །ས་ལ་འགྱེལ་བ་མཐོང་ནས་ནི། །
en: “ ‘All of the queen’s retinue also Were weeping with pitiful cries On seeing that the principal queen Had fainted and was lying on the floor.

source: དེ་མ་ཐག་ཏུ་རྒྱལ་དབང་དེ། །བུ་དང་བྲལ་བའི་མྱ་ངན་ནོན། །བློན་པོ་དང་ནི་འཁོར་རྣམས་ཀྱང་། །གཞོན་ནུ་རྣམས་ནི་བཙལ་ཕྱིར་དོང་། །
en: “ ‘Immediately, the lord of kings, Oppressed by the misery of losing his sons, Dispatched his ministers and court To go in search of the youths.

source: གྲོང་ཁྱེར་ཀུན་གྱི་སྐྱེ་བོ་དག །ཐ་དད་ཁྱིམ་ནས་བྱུང་ཞིང་འཁོད། །
en: “ ‘All the people throughout the town Came out of their homes and gathered.

source: ངུ་ཞིང་གདོང་ནས་མཆི་མ་ཟག །ལམ་ཀར་སྙིང་སྟོབས་ཆེ་དེ་འདྲི། །གསོན་ཏམ་འོན་ཏེ་ཤི་འམ་ཅི། །
en: Weeping, with tears streaming down their faces, They asked about Mahāsattva on the roads: “ ‘ “Is he alive or is he dead?

source: སྙིང་སྟོབས་ཆེན་པོ་དེ་གར་སོང་། །
en: Where has Mahāsattva gone?

source: བདག་ཅག་དེ་རིང་མཐོང་ཞིག་གམ། །
en: Will we see him today?

source: ཡིད་འོང་སེམས་ཅན་མཐོང་རེ་དགའ། །
en: How joyful to see that delightful being!”

source: དེའུ་རེ་མི་སྙན་ཐོས་འགྱུར་ཞིང་། །ཡུལ་འདིར་མྱ་ངན་མི་བཟད་རླུང་། །སྒྲ་མི་ཕྱིན་ཅིང་སྒྱུ་མཐའ་ཡས། །དྲག་པོའི་སྒྲར་བཅས་ལྡང་ཞིག་གམ། །
en: “ ‘They soon heard an unpleasant sound, A dreadful wind of misery in this land— Endless manifestations that emitted no sound, Together with those with ferocious sounds.

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེ་ལངས་ཏེ། །མྱ་ངན་ནོན་ཅིང་ངུ་བཞིན་དུ། །བཙུན་མོ་དམ་པ་སར་འགྱེལ་ལ། །བདག་ཉིད་ཆུ་ཡི་རྒྱུན་ཀྱང་འཐོར། །
en: “ ‘King Mahāratha, standing up, Oppressed by misery and weeping, Continually sprinkled water on The principal queen lying on the floor.

source: ཇི་སྲིད་དྲན་རྙེད་ལྡན་འགྱུར་བ། །དེ་སྲིད་དུ་ནི་ཆུ་ཡིས་གཏོར། །
en: “ ‘He continued to sprinkle water Until she had regained consciousness.
